namespace SerializationDeserialization
{
    // JSON (JavaScript Object Notation) — це текстовий формат для зберігання та передачі даних,
    // який є легким для читання та написання людиною, а також легким для парсингу та генерації машинами.

    internal class JSON
    {
        // Приклад:
        // { - початок об’єкта
        //  "Name": "Anna", - поле Name зі значенням "Anna"// Назва поля в лапках, двокрапка, значення в лапках (рядок)
        //  "Level": 5 - поле Level зі значенням 5 // Назва поля в лапках, двокрапка, значення без лапок (число)
        // } - кінець об’єкта

        // Людина читає
        // Машина читає
        // Працює в C#, JS, Python, Java і багатьох інших мовах
        // Підтримує вкладені об’єкти
        // Підтримує масиви

    }
}
