using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Events
{
    internal class WhatIsAnEvent
    {
        // Events це спеціальні делегати, які використовуються для повідомлення інших частин програми про те, що щось сталося.

        // Вони дозволяють об'єктам підписуватися на повідомлення про певні події та реагувати на них.
        // Наприклад, коли користувач натискає кнопку, може бути викликано подію "ButtonClicked", і всі підписані на цю подію обробники будуть виконані.
        // Це дозволяє створювати більш модульний та гнучкий код, де різні частини програми можуть взаємодіяти між собою без прямого зв'язку.

        // Синтаксис оголошення події в C# включає використання ключового слова "event" разом з типом делегата, який визначає сигнатуру обробника події. Ось загальний синтаксис:
        // [модифікатори] event ТипДелегата НазваПодії;
        // Де:
        // - [модифікатори] - це необов'язкові модифікатори доступу (наприклад, public, private, protected) або інші модифікатори (наприклад, static).
        // - ТипДелегата - це тип делегата, який визначає сигнатуру обробника події (наприклад, EventHandler або власний делегат).
        // - НазваПодії - це ім'я події, яке використовується для підписки та виклику.

        // Приклад оголошення події:
        public delegate void MyEventHandler(string message); // Визначення делегата
        public event MyEventHandler MyEvent; // Оголошення події на основі делегата


    }
}
