namespace Events
{
    internal class DelegateVsEvent
    {
        // Делегат дозволяє безпосередньо викликати методи, на які він посилається, тоді як подія забезпечує механізм підписки та відписки від цих методів.
        // Події забезпечують більший контроль над тим, хто може викликати методи, на які вони посилаються.
        // Це означає, що лише клас, який оголосив подію, може викликати її, тоді як будь-хто з доступом до делегата може викликати його методи.
        // Події також підтримують багатократну підписку, що означає, що кілька методів можуть бути підписані на одну подію.
        // Це дозволяє створювати більш складні механізми обробки подій, де кілька обробників можуть реагувати на одну подію.
        // Загалом, події є більш безпечним і контрольованим способом роботи з делегатами в контексті обробки подій.
    }
}
