namespace SOLID
{
    // Принцип                                                                     Що він захищає
    // SRP (Single Responsibility Principle) - Принцип єдиної відповідальності    від великих класів
    // OCP (Open/Closed Principle) - Принцип відкритості/закритості               від змін у старому коді
    // LSP (Liskov Substitution Principle) - Принцип підстановки Лісков           від порушення ієрархії класів (від нечесного спадкування)
    // ISP (Interface Segregation Principle) - Принцип розділення інтерфейсів     від великих інтерфейсів
    // DIP (Dependency Inversion Principle) - Принцип інверсії залежностей        від жорстких залежностей між класами
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }

    // Розуміння SOLID
    // Знайомство з принципами SOLID – це питання щоденної практики.
    // Уявіть їх як п’ять основних правил, які завжди слід пам’ятати під час кодування.

    // Ось зручний підсумок:
    // — Єдина відповідальність: Переконайтеся, що класи виконують лише одну дію та мають лише одну причину для зміни.
    // — Відкрито-закрито: Ви повинні мати можливість розширювати функціональність класу, не змінюючи те, як він вже працює.
    // — Підстановка Ліскова: Підкласи повинні бути замінюваними своїми базовими класами.
    // — Розділення інтерфейсів: Зберігайте короткі інтерфейси з невеликою кількістю методів. Клієнти реалізують лише те, що їм потрібно.
    // — Інверсія залежностей: Залежьте від абстракцій. Не залежьте безпосередньо від одного конкретного класу до іншого.
    // Принципи SOLID – це рекомендації, які допоможуть вам писати чистіший код, щоб його було ефективніше підтримувати та розширювати.

    // У деяких випадках дотримання SOLID може призвести до додаткової роботи на початку.
    // Можливо, вам доведеться рефакторинг деяких ваших функцій в абстракції або інтерфейси.
    // Однак часто це приносить довгострокову економію.

    // Зберігайте простоту та не намагайтеся нав’язувати принципи у своїх скриптах лише заради того, щоб це зробити.
    // Нехай вони органічно самі себе встановлять через необхідність.

    // Після SOLID студенти часто починають переускладнювати все, і саме тут потрібен KISS.
    // KISS — Keep It Simple, Stupid
    // Зберігай простоту, дурню

    // Пам’ятайте, що SOLID – це рекомендації, а не жорсткі правила. Вони допомагають вам писати чистіший код, але не завжди потрібно їх суворо дотримуватися.
    // Важливо знайти баланс між дотриманням SOLID і збереженням простоти вашого коду.
    // Не намагайтеся нав’язувати принципи там, де вони не потрібні, але також не ігноруйте їх, коли вони можуть допомогти вам писати більш чистий та підтримуваний код.

    // SOLID — це про правильну архітектуру.
    // KISS — це про здоровий глузд.


}
