namespace Delegates
{
    internal class InvokingDelegates
    {
        // Існує кілька способів виклику делегатів:
        private delegate int MathOperation(int a, int b);

        private int Add(int x, int y)
        {
            return x + y;
        }

        public void Example()
        {
            MathOperation operation = Add;

            // 1. Виклик делегата як методу
            operation(10, 5);
          
            // 2. Виклик делегата через метод Invoke
            operation.Invoke(20, 10);

            // Обидва способи виклику делегата є еквівалентними.
            // Ви можете використовувати будь-який з них залежно від ваших уподобань.
            // Навіщо використовувати Invoke?
            // Виклик делегата як методу є більш поширеним і зручним способом.
            // Однак метод Invoke може бути корисним у деяких випадках, наприклад, коли ви працюєте з делегатами динамічно або використовуєте рефлексію.
            // У більшості випадків виклик делегата як методу є більш читабельним і простим способом.

            // Перевірка на null перед викликом делегата
            if (operation != null)
            {
                operation(30, 15);
            }

            // Або використання оператора умовного доступу (?.)
            // ?. може бути використаний лише з методами Invoke.
            operation?.Invoke(40, 20);

            // Ці підходи допомагають уникнути виклику делегата, якщо він не має жодних методів у своєму списку викликів.
        }
    }
}
