namespace Delegates
{
    internal class WhatAreMulticastDelegates
    {
        // Мультикаст делегати — це делегати, які можуть посилатися на кілька методів одночасно.

        // Вони дозволяють викликати всі методи, на які вони посилаються, послідовно.
        // Це корисно для реалізації подій і зворотних викликів, де потрібно виконати кілька дій у відповідь на певну подію.

        // Ось кілька ключових моментів про мультикаст делегати:
        // 1. Додавання методів: Ви можете додавати методи до мультикаст делегата за допомогою оператора +=.
        // 2. Видалення методів: Ви можете видаляти методи з мультикаст делегата за допомогою оператора -=.
        // 3. Виклик методів: Коли ви викликаєте мультикаст делегат, всі методи в його списку викликів виконуються послідовно.
        // 4. Порядок виклику: Методи викликаються в тому порядку, в якому вони були додані до делегата.
        // 5. Повернення значення: Якщо мультикаст делегат має тип повернення, повертається значення останнього викликаного методу.
        // 6. Обробка винятків: Якщо один з методів у мультикаст делегаті викликає виняток, виконання зупиняється, і виняток передається виклику.

        public delegate void Notify(string message);
        public void Example()
        {
            Notify notify = MessageA;
            // Додавання інших методів до мультикаст делегата
            notify += MessageB;
            notify += MessageC;

            // Виклик мультикаст делегата
            notify("Hello, World!");

            // Видалення одного з методів
            notify -= MessageB;

            // Виклик мультикаст делегата після видалення методу
            notify("Hello again!");

            // Підкреслює зелененьким тому що виклик після видалення може містити null
            // З перевіркою на null не підкреслює
            notify?.Invoke("Final call!");
        }
        private void MessageA(string msg)
        {
            Console.WriteLine($"MessageA: {msg}");
        }
        private void MessageB(string msg)
        {
            Console.WriteLine($"MessageB: {msg}");
        }
        private void MessageC(string msg)
        {
            Console.WriteLine($"MessageC: {msg}");
        }

        // Змінні делегата можна додавати і віднімати за допомогою операторів + і - відповідно.
        // Це дозволяє створювати складніші ланцюжки викликів методів.
        public void Example2()
        {
            Notify notify = MessageA;
            Notify anotherNotify = MessageB;

            // Додавання двох делегатів
            Notify combinedNotify = notify + anotherNotify;

            // Виклик комбінованого делегата
            combinedNotify("Combined call!");

            // Видалення одного делегата
            Notify? reducedNotify = combinedNotify - notify;

            // Виклик зменшеного делегата
            if (reducedNotify != null)
            {
                reducedNotify("Reduced call!");
            }
        }

    }
}
