namespace Delegates
{
    internal class AnonymousMethods
    {
        // Анонімні методи дозволяють створювати делегати без необхідності оголошувати окремі методи.
        // Вони корисні, коли вам потрібен короткий блок коду, який буде використовуватися лише один раз.

        // Синтаксис анонімного методу використовує ключове слово delegate, за яким слідує список параметрів і тіло методу.

        public delegate int MathOperation(int a, int b);

        public void Example()
        {
            // Використання анонімного методу для додавання двох чисел
            MathOperation add = delegate (int x, int y)
            {
                return x + y;
            };
            int sum = add(10, 5); // sum буде 15

            // Використання анонімного методу для множення двох чисел
            MathOperation multiply = delegate (int x, int y)
            {
                return x * y;
            };
            int product = multiply(10, 5); // product буде 50
        }

        // Можливості анонімних методів:
        // 1. Захоплення змінних: Анонімні методи можуть захоплювати змінні з зовнішнього контексту, що дозволяє їм використовувати ці змінні всередині свого тіла. 
        // 2. Гнучкість: Анонімні методи можуть бути створені динамічно під час виконання програми, що робить їх гнучкими для різних сценаріїв використання.

        // Обмеження анонімних методів:
        // 1. Відсутність імені: Оскільки анонімні методи не мають імені, їх важче відлагоджувати та повторно використовувати в інших частинах коду.
        // 2. Обмежена функціональність: Анонімні методи не можуть містити деякі конструкції, такі як оператори goto, що може обмежувати їх використання в певних випадках.
        // 3. Застарілість: З появою лямбда-виразів в C# анонімні методи стали менш популярними, оскільки лямбда-вирази пропонують більш компактний і читабельний синтаксис для створення делегатів.
        // В сучасному C# лямбда-вирази зазвичай надають кращу альтернативу анонімним методам.
    }
}
