using System.Diagnostics.Metrics;
using System.Reflection;

namespace ProcessesAndThreads
{
    // Коли кілька потоків звертаються до спільних даних — виникають проблеми.
    // Аналогія:
    // Два офіціанти (потоки) пишуть у один блокнот (спільна змінна) одночасно. Записи переплутаються — це Race Condition.
    internal class Synchronization
    {
        // Приклад Race Condition

        public void RaceConditionExample()
        {   // Спільна змінна, до якої звертаються обидва потоки
            int counter = 0;

            // Два потоки, які одночасно збільшують лічильник
            Thread thread1 = new Thread(() =>
            {
                for (int i = 0; i < 100000; i++)
                {
                    counter++; // Небезпечна операція 
                    // counter++ не є атомарною операцією.
                    // Вона складається з трьох кроків: читання значення, збільшення та запис назад.
                    // Якщо два потоки виконують цю операцію одночасно, вони можуть прочитати одне й те саме значення, збільшити його і записати назад,
                    // що призведе до втрати одного збільшення.
                }
            });
            Thread thread2 = new Thread(() =>
            {
                for (int i = 0; i < 100000; i++)
                {
                    counter++; // Небезпечна операція
                }
            });

            thread1.Start();
            thread2.Start();
            thread1.Join(); // Чекаємо, поки перший потік завершиться
            thread2.Join(); // Чекаємо, поки другий потік завершиться
            Console.WriteLine($"Final Counter Value: {counter}"); // Очікуємо 200000, але отрима

            // RaceCondition не завжди проявляється, а іноді
            // Саме тому вони такі небезпечні — вони можуть викликати непередбачувані помилки, які важко відтворити та виправити.
        }

        // Рішення проблем 1 — це синхронізація потоків. В C# є кілька механізмів для цього:
        // - lock: дозволяє блокувати доступ до певного коду або ресурсу, щоб тільки один потік міг його виконувати в один момент часу.

        public void SynchronizationExample()
        {
            int counter = 0;
            object lockObject = new object(); // Об'єкт для блокування
            // lockObject може бути будь-яким об'єктом, але зазвичай використовують окремий об'єкт, щоб уникнути випадкових блокувань інших частин коду.


            Thread thread1 = new Thread(() =>
            {
                for (int i = 0; i < 100000; i++)
                {
                    // Аналогія:
                    // lock — це як замок на дверях.
                    // Якщо один офіціант (потік) зайшов у кімнату (заблокував ресурс), інші офіціанти повинні почекати, поки він не вийде (розблокує ресурс), щоб зайти.
                    // Або уявіть естафетну паличку: тільки той, хто тримає паличку (має lock), може виконувати певну дію. Інші повинні чекати, поки паличка не буде передана їм.
                    lock (lockObject) // Блокування доступу до коду, який змінює counter
                    {
                        counter++;
                    }
                }
            });
            Thread thread2 = new Thread(() =>
            {
                for (int i = 0; i < 100000; i++)
                {
                    lock (lockObject) // Блокування доступу до коду, який змінює counter
                    {
                        counter++;
                    }
                }
            });
            thread1.Start();
            thread2.Start();
            thread1.Join();
            thread2.Join();
            Console.WriteLine($"Final Counter Value: {counter}"); // Тепер отримаємо правильне значення 200000
        }

        // Рішення проблем 2 — це використання атомарних операцій або класів з пакету System.Threading, таких як Interlocked, які забезпечують безпечні операції над спільними змінними без необхідності блокування.
        public void SynchronizationExample2()
        {
            int counter = 0;
            Thread t1 = new Thread(() =>
            {
                for (int i = 0; i < 100000; i++)
                    Interlocked.Increment(ref counter); // атомарна операція на рівні CPU 
                
            });

            Thread t2 = new Thread(() =>
            {
                for (int i = 0; i < 100000; i++)
                    Interlocked.Increment(ref counter); // атомарна операція на рівні CPU
            });

            t1.Start();
            t2.Start();
            t1.Join();
            t2.Join();
        }
    }
}
