namespace LSP
{
    // Liskov Substitution Principle - Принцип підстановки Лісков
    // Підкласи повинні бути замінними на свої базові класи без порушення правильності програми.
    // Простими словами ви повинні мати змогу замінити базовий клас на будь-який його підклас, і ваш код навіть не «помітить» різниці
    internal class Program
    {
        static void Main(string[] args)
        {
            
        }
    }
    // Як зрозуміти, що ви НЕ порушуєте LSP?
    // 1. Ви можете замінити базовий клас на будь-який його підклас, і код все одно працюватиме.
    // 2. Підкласи не повинні змінювати поведінку базового класу. Вони можуть розширювати його, але не змінювати його основну функціональність.
    // 3. Підкласи не повинні кидати нові виключення, які не передбачені базовим класом.
    // 4. Підкласи не повинні вимагати від клієнтів виконання додаткових дій, які не потрібні для базового класу.

    // 5. Чи викидаю я NotImplementedException або NotSupportedException? Якщо так — це майже напевно порушення.
    // 6. Чи змінюю я поведінку базового класу? Якщо так — це майже напевно порушення. (Наприклад, метод Add() у батька додає елемент, а в сина — видаляє). Якщо так — це порушення.
    // 7. Чи доводиться мені в клієнтському коді писати if (obj is MyClass)? Якщо так — ваша абстракція (батьківський клас/інтерфейс) не справляється зі своєю роллю.

    // Мій улюблений вислів про LSP:
    // !!!
    // Якщо це виглядає як качка, плаває як качка і крякає як качка, то це, швидше за все, качка
    // !!!
    // Якщо це виглядає як качка, крякає як качка, але потребує батарейок для роботи — у вас неправильна абстракція і це не качка.


}
