namespace DIP
{
    // DIP - Dependency Inversion Principle (Принцип інверсії залежностей)
    // Високорівневі модулі не повинні залежати від низькорівневих модулів.
    // Обидва повинні залежати від абстракцій.
    // Абстракції не повинні залежати від деталей.
    // Деталі повинні залежати від абстракцій.

    // Простими словами
    // Бізнес-логіка не повинна напряму залежати від конкретної реалізації.

    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }

}
