using OCP.GoodExamlpe;

namespace OCP
{
    internal class Program
    {
        // Open/Closed Principle - Принцип відкритості/закритості
        // Клас повинен бути відкритим для розширення, але закритим для модифікації.
        // Людською мовою це означає, що ми повинні мати можливість додавати нову функціональність до класу без необхідності змінювати існуючий код.
        static void Main(string[] args)
        {
            var discountService = new DiscountService();
            discountService.ApplyDiscount(1000, new BlackFridayDiscount());

        }

        // OCP стає потрібним, коли:
        // 1. Ваш код часто змінюється для додавання нової функціональності.
        // 2. Ви хочете зменшити ризик помилок при зміні існуючого коду.
        // 3. Ви хочете зробити свій код більш гнучким і легким для розширення.
        // Щоб дотримуватись OCP, використовуйте інтерфейси або абстрактні класи для визначення контрактів, а потім реалізуйте ці контракти в конкретних класах.
        // Це дозволить вам додавати нові функціональності, створюючи нові класи, не змінюючи існуючий код.
    }
}
